snlkuharlocal/src/Documents/ДоступКИТ_Ресурсам/ДоступКИТ_Ресурсам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДоступКИТ_Ресурсам</name>
  <registerRecords>InformationRegister.ДоступкИТ_Ресурсам</registerRecords>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравоДоступа</name>
    <type>
      <types>EnumRef.ПраваДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Доступ</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ИТ_Ресурс</name>
      <type>
        <types>CatalogRef.ИТ_Ресурсы</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ДоступкИТ_Ресурсам/ДоступкИТ_Ресурсам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоступкИТ_Ресурсам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПравоДоступа</name>
    <type>
      <types>EnumRef.ПраваДоступа</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИТ_Ресурс</name>
    <type>
      <types>CatalogRef.ИТ_Ресурсы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ДоступКИТ_Ресурсам/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Если НЕ Отказ Тогда
		
		Движения.ДоступкИТ_Ресурсам.Записывать = Истина;
		Движения.ДоступкИТ_Ресурсам.Очистить();
		
		Для Каждого ТекСтрока Из Доступ Цикл
			Если ЗначениеЗаполнено(ТекСтрока.ДатаВыполнения) Тогда
				Движение = Движения.ДоступкИТ_Ресурсам.Добавить();
				
				Движение.Период = ТекСтрока.ДатаВыполнения;
				Движение.Регистратор = Ссылка;
				
				Движение.Сотрудник = ТекСтрока.Сотрудник;
				Движение.ИТ_Ресурс = ТекСтрока.ИТ_Ресурс;
				Движение.ПравоДоступа = ПравоДоступа;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
